app/controllers/tiers_controller.rb

  def getUsers
    @tier = Tier.find(params[:tier_id])
---
SELECT  "tiers".* FROM "tiers" WHERE "tiers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]